Revit 2022 API
FabricationConfigurationInfo Members
The FabricationConfigurationInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationConfigurationInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindSourceFabricationConfiguration
 Finds the source fabrication configuration on disk which matches the input fabrication configuration.
GetAllFabricationConfigurations
 Gets all added fabrication configurations.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetProfiles
 Return the profiles in the fabrication configuration.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Checks if the fabrication configuration is valid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CloudId
 The identifier of the cloud configuration.
CloudVersion |  Obsolete.
 This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
Description
 The description of the fabrication configuration.
GUID
 The unique identification of the fabrication configuration.
IsCloudConfiguration
 Whether the cloud configuration is a remote cloud one.
IsConnected |  Obsolete.
 This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
IsLocked
 Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the fabrication configuration.
Path
 The path where the fabrication configuration is located. To populate this property, you may need to call FindSourceFabricationConfiguration first.
UnitSystem
 The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial.
Version
 The version of the fabrication configuration.
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace